Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མངོན་པར་གནས་པས་བཞོན་པ་ལྟ་བུའོ། །
en: It is like a carriage because all bodhisattvas are situated in it.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་སྒོར་འཇུག་པར་བྱེད་པས་སྒོ་ལྟ་བུའོ། །
en: It is like a door because it enables entry through the gateway to all bodhisattva conduct.

source: ཏིང་ངེ་འཛིན་གྱི་ཁང་པ་ན་གནས་པར་བྱེད་པས་གཞལ་མེད་ཁང་ལྟ་བུའོ། །
en: It is like a divine palace because it enables one to dwell in the mansion of samādhi.

source: ཆོས་ཀྱི་དགའ་བ་དང་མོས་པ་ཉམས་སུ་མྱོང་བར་བྱེད་པས་བཟའ་ཤིང་གི་ར་བ་ལྟ་བུའོ། །
en: It is like a park because it enables one to experience the joy of the Dharma.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པས་གནས་ལྟ་བུའོ། །
en: It is like a shelter because it protects all beings.

source: འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ་སྐྱེད་པས་རྟེན་ལྟ་བུའོ། །
en: It is like a support because it brings benefit to all worlds.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་སྤྱོད་པར་བྱེད་པས་གཞི་ལྟ་བུའོ། །
en: It is like a foundation because it enables the practice of all bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་སྲུང་བས་ཕ་ལྟ་བུའོ། །
en: It is like a father because it protects all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་མ་ལྟ་བུའོ། །
en: It is like a mother of all great bodhisattvas.

source: ཐམས་ཅད་ལས་ཡོངས་སུ་སྐྱོང་བས་མ་མ་ལྟ་བུའོ། །
en: It is like a nanny because it looks after others thoroughly.

source: སློབ་པ་དང་མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཟིལ་གྱིས་གནོན་པས་རྒྱལ་པོ་ལྟ་བུའོ། །
en: It is like a king because it outshines the minds of all training and trained śrāvakas and pratyeka­buddhas.

source: སྨོན་ལམ་ཐམས་ཅད་ཀྱིས་ཁྱད་པར་དུ་འཕགས་པས་དབང་པོ་ལྟ་བུའོ། །
en: It is like a lord because it is superior to all other prayers.

source: ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་འདུ་བས་རྒྱ་མཚོ་ཆེན་པོ་ལྟ་བུའོ། །
en: It is like a great ocean because it gathers into itself all good qualities.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པས་རིན་པོ་ཆེ་ལྟ་བུའོ། །
en: It is like great Meru because it has the same motivation toward all beings.

source: འཇིག་རྟེན་ཐམས་ཅད་རྟེན་པས་ཁོར་ཡུག་ལྟ་བུའོ། །
en: It is like the Cakravāla mountain range because it supports the whole world.

source: ཡེ་ཤེས་ཀྱི་སྨན་རྣམ་པར་འཕེལ་བར་བྱེད་པས་གངས་ཀྱི་རི་ལྟ་བུའོ། །
en: It is like the Himalayas because it multiplies the herbs of wisdom.

source: ཡོན་ཏན་གྱི་སྤོས་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པས་སྤོས་ཀྱི་ངད་ལྡང་བ་ལྟ་བུའོ། །
en: It is like Gandhamādana Mountain because from it comes all the aroma of good qualities.

source: ཡོན་ཏན་རྒྱ་ཆེ་བས་ནམ་མཁའ་ལྟ་བུའོ། །
en: It is like the sky because of the vast expanse of good qualities.

source: འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པས་པད་མོ་ལྟ་བུའོ། །
en: It is like a lotus because it is unstained by all worldly concerns.

source: སེམས་དུལ་ཞིང་ཅང་ཤེས་པས་གླང་པོ་ལྟ་བུའོ། །
en: It is like an elephant because the mind is disciplined and tamed.

source: རྒོད་པ་ཐམས་ཅད་དང་བྲལ་བས་རྟ་ཅང་ཤེས་ལྟ་བུའོ། །
en: It is like a thoroughbred stallion because it is free of all wildness.

source: ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་སྐྱོང་བའི་སྔོན་དུ་འགྲོ་བས་ཁ་ལོ་སྒྱུར་བ་ལྟ་བུའོ། །
en: It is like a charioteer because it is the vanguard that protects the Mahāyāna.

source: ཉོན་མོངས་པའི་ནད་སོས་པར་བྱེད་པས་སྨན་ལྟ་བུའོ། །
en: It is like a physician because it cures the illness of the kleśas.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཟད་པར་བྱེད་པས་སའི་འོག་ལྟ་བུའོ། །
en: It is like the Pātāla worlds because it causes all bad qualities to vanish.

source: ཆོས་ཐམས་ཅད་ངེས་པར་ཁོང་དུ་ཆུད་པར་བྱེད་པས་རྡོ་རྗེ་ལྟ་བུའོ། །
en: It is like a vajra because it penetrates definitively into all Dharmas.

source: ཡོན་ཏན་གྱི་དྲི་ཞིམ་པར་བྱེད་པས་སྤོས་ཀྱི་སྣོད་ལྟ་བུའོ། །
en: It is like a censer because it creates the lovely aroma of good qualities.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་མངོན་པར་དགའ་བས་མེ་ཏོག་དམ་པ་ལྟ་བུའོ། །
en: It is like an excellent flower because all the world delights to see it.

source: འདོད་ཆགས་ཀྱི་གདུང་བ་བསིལ་བར་བྱེད་པས་ཁ་བའི་ཙན་དན་ལྟ་བུའོ། །
en: It is like Himalayan sandalwood because it cools the fever of the kleśas.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པས་ཨ་ག་རུ་ནག་པོ་ལྟ་བུའོ། །
en: It is like black agarwood because it pervades the realm of phenomena.

source: ཉོན་མོངས་པའི་ནད་ཐམས་ཅད་འཇོམས་པས་སྨན་གྱི་རྒྱལ་པོ་བལྟ་ན་སྡུག་པ་ལྟ་བུའོ། །
en: It is like the beautiful king of medicines because it defeats all the illnesses of the kleśas.

source: བག་ལ་ཉལ་བའི་ཟུག་རྔུ་ཐམས་ཅད་ཡང་དག་པར་འབྱིན་པས་འབྲལ་བར་བྱེད་པའི་སྨན་ལྟ་བུའོ། །
en: It is like a medicine for extraction, because it perfectly removes all the splinters that are predispositions.

source: དབང་པོ་ཐམས་ཅད་ལ་དབང་སྒྱུར་བས་དབང་པོ་ལྟ་བུའོ། །
en: It is like Indra because it is sovereign over all the faculties.

source: དབུལ་བ་ཐམས་ཅད་ཡོངས་སུ་སེལ་བས་ངལ་བསོ་པོ་ལྟ་བུའོ། །
en: It is like Vaiśravaṇa because it dispels all poverty.

source: ཡོན་ཏན་ཐམས་ཅད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱེད་པས་དཔལ་ལྟ་བུའོ། །
en: It is like splendor because it adorns with all good qualities.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཛེས་པར་བྱེད་པས་ལྷབ་ལྷུབ་ལྟ་བུའོ། །
en: It is like jewelry because it beautifies all bodhisattvas.

source: ཉེས་བྱས་ཐམས་ཅད་སྲེག་པས་བསྐལ་པས་ཚིག་པའི་མེ་ལྟ་བུའོ། །
en: It is like the inferno at the kalpa’s end because it burns away all evil.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱེད་པས་རྩ་བ་མ་གྲུབ་པའི་སྨན་གྱི་རྒྱལ་པོ་ཆེན་པོ་ལྟ་བུའོ། །
en: It is like the great king of medicine that has no root, because it increases all the buddha qualities.

source: ཉོན་མོངས་པའི་དུག་ཐམས་ཅད་རྣམ་པར་སེལ་བས་ཀླུའི་རིན་པོ་ཆེ་ལྟ་བུའོ། །
en: It is like a nāga’s jewel because it eliminates all the poisons of the kleśas.

source: རྙོག་པ་ཐམས་ཅད་སེལ་བས་ནོར་བུ་རིན་པོ་ཆེ་ཆུར་དང་ལྟ་བུའོ། །
en: It is like the water-purifying jewel because it dispels all pollution.

source: དོན་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པས་ཡིད་བཞིན་གྱི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ལྟ་བུའོ། །
en: It is like the king of wish-fulfilling jewels because it accomplishes all goals.

source: བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་བུམ་པ་བཟང་པོ་ལྟ་བུའོ། །
en: It is like the miraculous vase because it fulfills all wishes.

source: ཡོན་ཏན་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་ཆར་མངོན་པར་འབེབས་པས་འདོད་སྦྱིན་གྱི་ཤིང་ལྟ་བུའོ། །
en: It is like a wish-fulfilling tree because it sends down a rain of the jewelry of all good qualities.

source: འཁོར་བའི་སྐྱོན་ཐམས་ཅད་དང་མ་འདྲེས་པས་གོས་དང་རིས་ཅན་ལྟ་བུའོ། །
en: It is like goose-quality clothing because it is unblended with any of the faults of saṃsāra.

source: རང་བཞིན་གྱིས་འོད་གསལ་བས་ཤིང་བལ་གྱི་རྒྱུད་ལྟ་བུའོ། །
en: It is like cotton cloth because it is naturally bright.

source: སེམས་ཅན་གྱི་བསམ་པའི་ཞིང་རྣམ་པར་སྤྱོད་པས་གཤོལ་ལྟ་བུའོ། །
en: It is like a plow because it purifies the field of the aspirations of beings.

source: འཇིག་ཚོགས་ཀྱི་གོ་ཅ་རྟོལ་བས་མདེའུ་ཐུང་ལྟ་བུའོ། །སྡུག་བསྔལ་གྱི་འབེན་ངེས་པར་འབིགས་པས་མདའ་ལྟ་བུའོ། །
en: It is like an arrow because it pierces the armor of the view of the reality of destructible aggregations.

source: ཉོན་མོངས་པའི་དགྲ་ལས་རྣམ་པར་རྒྱལ་བར་བྱེད་པས་མདུང་ལྟ་བུའོ། །
en: It is like a spear because it vanquishes the enemy that is the kleśas.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་འགེབས་པས་གོ་ཅ་ལྟ་བུའོ། །
en: It is like armor because it protects from incorrect mental activity.

source: ཉོན་མོངས་པའི་ཀླད་འགེམས་པས་རལ་གྲི་ལྟ་བུའོ། །
en: It is like a sword because it decapitates the kleśas.

source: ང་རྒྱལ་དང་དྲེགས་པ་དང་རློམ་པའི་གོ་ཅ་འདྲལ་བས་རལ་གྲིའི་སོ་ལྟ་བུའོ། །
en: It is like a sword’s blade because it cuts through the armor of pride, conceit, and arrogance.

source: བག་ལ་ཉལ་གྱི་གོ་ཆ་གཤོག་པས་མདའ་སྟེའུ་ཀ་ལྟ་བུའོ། །
en: It is like an arrowhead because it pierces the armor of predispositions.

source: ང་རྒྱལ་གྱི་རྒྱལ་མཚན་སྙོལ་བས་དཔའ་བོའི་རུ་མཚོན་ལྟ་བུའོ། །
en: It is like a military standard because it overthrows the banner of pride.

source: མི་ཤེས་པའི་ཤིང་སྒྱེལ་བར་བྱེད་པས་ལག་ཆ་ལྟ་བུའོ། །
en: It is like a cutting tool because it brings down the tree of ignorance.

source: སྡུག་བསྔལ་གྱི་ཤིང་རབ་ཏུ་གཅོད་པས་སྟ་རེ་ལྟ་བུའོ། །
en: It is like an axe because it cuts down the tree of suffering.

source: གནོད་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་སྐྱོབ་པས་མཚོན་ཆ་ལྟ་བུའོ། །
en: It is like a weapon because it protects from all harm.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལུས་ཡོངས་སུ་སྲུང་བས་ལག་པ་ལྟ་བུའོ། །
en: It is like hands because it guards the body of the perfections.

source: ཡོན་ཏན་ཐམས་ཅད་ལ་སོ་སོར་འགོད་པས་རྐང་པ་ལྟ་བུའོ། །
en: It is like feet because it is situated in all qualities.

source: མ་རིག་པའི་པྲིའི་ལིང་ཏོག་ཡོངས་སུ་སེལ་བས་མིག་མཁན་ལྟ་བུའོ། །
en: It is like an eye physician because it removes the cataracts of ignorance.

source: འཇིག་ཚོགས་ཀྱི་ཟུག་རྔུ་ཡང་དག་པར་འབྱིན་པས་སྐམ་པ་ལྟ་བུའོ། །
en: It is like tweezers because it removes the splinters of the view of the destructible aggregation as real.

source: བག་ལ་ཉལ་གྱི་ཚེར་མ་འབྱིན་པས་ཚེར་ཟུང་ལྟ་བུའོ། །
en: It is like a sickle because it clears away the thorns of predispositions.

source: འཁོར་བའི་བཅིངས་པ་ལས་ཡོངས་སུ་འགྲེལ་པས་མཛའ་བོ་ལྟ་བུའོ། །
en: It is like a friend because it frees you from the bondage of saṃsāra.

source: གནོད་པ་ཐམས་ཅད་སེལ་བས་ནོར་བུ་ལྟ་བུའོ། །
en: It is like a jewel because it dispels all harm.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་འབྱུང་བའི་ལམ་མངོན་པར་ཤེས་པར་བྱེད་པས་གཙུག་ལག་ལྟ་བུའོ། །
en: It is like a text because it enables you to know the path of the arising of bodhisattva conduct.

source: བསོད་ནམས་མི་ཟད་པས་གཏེར་ལྟ་བུའོ། །
en: It is like a treasure because of its inexhaustible merit.

source: ཡེ་ཤེས་མི་ཟད་པས་ཆུ་མིག་ལྟ་བུའོ། །
en: It is like a spring because of its unceasing wisdom.

source: ཆོས་ཐམས་ཅད་ཀྱི་གདོང་གི་གཟུགས་བརྙན་སྟོན་པས་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟ་བུའོ། །
en: It is like the surface of a mirror because it reveals the image of the face of all the Dharma.

source: འགོ་བ་མེད་པས་མེ་ཏོག་པུན་ད་རི་ཀ་ལྟ་བུའོ། །
en: It is like a white lotus because it is unstained.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བསྡུ་བའི་དངོས་པོ་རྒྱུན་ཏུ་འབབ་པས་ཆུ་ཀླུང་ཆེན་པོ་ལྟ་བུའོ། །
en: It is like a great river because in it there is the unceasing flow of the perfections and the methods of gathering pupils.

source: ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབེབ་པས་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ལྟ་བུའོ། །
en: It is like a great king of the nāgas because it causes rain to fall from the clouds of the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པས་འཚོ་བའི་དབང་པོ་ལྟ་བུའོ། །
en: It is like the power of life because it possesses the great compassion of all bodhisattvas.

source: འཆི་བ་མེད་པའི་དབྱིངས་སུ་ཕྱིན་པར་བྱེད་པས་བདུད་རྩི་ལྟ་བུའོ། །
en: It is like amrita because it enables one to go to the realm of deathlessness.

source: འདུལ་བའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྡུད་ཅིང་འདྲེན་པས་ཀུན་ནས་འཁོར་བའི་སྙིང་ལྟ་བུའོ། །
en: It is like an all-encompassing net of snares because it seizes and draws in all beings who are to be guided.

source: འཁོར་བའི་ཆུ་ལ་རྒྱུ་བ་མངོན་པར་འདོན་པས་མཆིལ་པ་ལྟ་བུའོ། །
en: It is like a fishhook because it pulls out those wandering in the river of saṃsāra.

source: ཡོན་ཏན་ཐམས་ཅད་ཀྱི་དྲི་ཞིམ་པོ་འཛིན་པས་སྤོས་ཀྱི་སྣོད་ལྟ་བུའོ། །
en: It is like a small casket of perfume because it possesses the lovely aroma of all good qualities.

source: ཤིན་ཏུ་ནད་མེད་པར་བྱེད་པས་དུག་སྨན་ལྟ་བུའོ། །
en: It is like healing medicine because it brings perfect health.

source: འདོད་པས་དགའ་བའི་དུག་མེད་པར་བྱེད་པས་དུག་གི་གཉེན་པོ་ལྟ་བུའོ། །
en: It is like an antidote to poison because it eliminates the poison of delight in desires.

source: ཚུལ་བཞིན་མ་ཡིན་པའི་དུག་ཐམས་ཅད་འབྱང་བར་བྱེད་པས་སྔགས་དང་གཟུངས་ལྟ་བུའོ། །
en: It is like a mantra and dhāraṇī because it purifies all the poisons of error.

source: སྒྲིབ་པ་དང་བར་ཆད་ཀྱི་རྩྭ་ཐམས་ཅད་རྣམ་པར་འཐོར་བས་རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུའོ། །
en: It is like the circle of the wind because it scatters all the grasses of obscurations and obstacles.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པས་རིན་པོ་ཆེའི་གླིང་ལྟ་བུའོ། །
en: It is like an island of jewels because it is the source of all the precious Dharma of the aspects of enlightenment.

source: ཆོས་དཀར་པོ་ཐམས་ཅད་འབྱུང་བས་རིགས་ལྟ་བུའོ། །
en: It is like a family because it is the origin of all good qualities.

source: ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་སྐྱེ་བའི་སྒོར་གྱུར་པས་འབྱུང་གནས་ལྟ་བུའོ། །
en: It is like a source because it is the gateway to the birth of all the phenomena of good qualities.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོང་པ་ཐམས་ཅད་ཀྱིས་སྤྱོད་པས་ཚོང་དུས་ལྟ་བུའོ། །
en: It is like a market because it is the conduct of all the bodhisattva merchants.

source: ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་དྲི་མ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བས་ཆུའི་ཁམས་ལྟ་བུའོ། །
en: It is like the element of water because it washes away all the stains of karma, kleśas, and obscurations.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་སྦྲང་རྩིའི་གནས་ལྟ་བུའོ། །
en: It is like a honeycomb because it completes the accumulation of omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པའི་ཕོ་བྲང་དུ་ཕྱིན་པར་བྱེད་པས་ལམ་ལྟ་བུའོ། །
en: It is like a road because it enables all bodhisattvas to reach the palace of omniscience.

source: ཆོས་དཀར་པོ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པས་སྣོད་ལྟ་བུའོ། །
en: It is like a vessel because it holds all good qualities.

source: ཉོན་མོངས་པའི་རྡུལ་ཐམས་ཅད་མི་ལྡང་བར་བྱེད་པས་ཆར་པ་ལྟ་བུའོ། །
en: It is like rain because it clears away all the floating dust of the kleśas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་ཐམས་ཅད་སྟོན་པས་གནས་ལྟ་བུའོ། །
en: It is like a dwelling because it reveals the state in which all bodhisattvas are established.

source: ཉན་ཐོས་ཀྱི་རྣམ་པར་གྲོལ་བ་དང་མི་འདྲེ་བས་རྡོ་བ་ཁབ་ལེན་ལྟ་བུའོ། །
en: It is like a magnet because it does not become attached to the liberation of the śrāvakas.

source: རང་བཞིན་གྱིས་དྲི་མ་མེད་པས་བཻཌཱུརྱ་ལྟ་བུའོ། །
en: It is like beryl because it is naturally stainless.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་འཇིག་རྟེན་ཤེས་པ་ཐམས་ཅད་ཟིལ་དུ་རླག་པ་དང་། ཟིལ་གྱིས་ནོན་པར་བྱེད་པས་ཨིནྡྲ་ནཱི་ལ་ལྟ་བུའོ། །
en: It is like sapphire because it overshadows and outshines the knowledge of all śrāvakas and pratyeka­buddhas and all worldly knowledge.

source: ཉོན་མོངས་པའི་གཉིད་ཀྱིས་ལོག་པའི་སེམས་ཅན་སད་པར་བྱེད་པས་ཐོ་རས་ཀྱི་རྔ་ལྟ་བུའོ། །
en: It is like the dawn drum because it wakes beings from the sleep of the kleśas.

source: རྙོག་པ་མེད་པས་ཆུ་དང་བ་ལྟ་བུའོ། །
en: It is like clear water because it is not polluted.

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ལ་སྤྱོད་པའི་དགེ་བའི་རྩ་བའི་ཚོགས་ཟིལ་དུ་བརླག་པར་བྱེད་པས་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རྒྱན་ལྟ་བུའོ། །
en: It is like jewelry made of Jambu River gold, because it overshadows all accumulations of roots of merit through composite activity.

source: འཇིག་རྟེན་གསུམ་ལས་མངོན་པར་འཕགས་པས་རིའི་རྒྱལ་པོ་ཆེན་པོ་ལྟ་བུའོ། །
en: It is like the great king of mountains because it is higher than the three worlds.

source: སྐྱབས་ཚོལ་བ་ཡོངས་སུ་མི་གཏོང་བས་སྐྱབས་ལྟ་བུའོ། །
en: It is like a refuge because it does not turn away those seeking refuge.

source: དོན་མ་ཡིན་པ་འཇོམས་པས་དོན་ལྟ་བུའོ། །
en: It is like meaning because it overcomes what is meaningless.

source: སྙིང་དགའ་བར་བྱེད་པས་དབྱིག་ལྟ་བུའོ། །
en: It is like wealth because it gladdens the heart.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པས་མཆོད་སྦྱིན་གྱི་ཡོ་བྱད་ལྟ་བུའོ། །
en: It is like charitable offerings because it brings satisfaction to all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་གཙོ་བོ་དང་ཐུ་བོར་གྱུར་པས་ན་རྒན་པ་ལྟ་བུའོ། །
en: It is like a senior person because it is chief and principal in the minds of all beings.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་འཛིན་པས་གླིང་གཞི་ལྟ་བུའོ། །
en: It is like a treasure because it holds all the Dharma of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་སྨོན་ལམ་ཐམས་ཅད་སྡུད་པས་མདོ་ལྟ་བུའོ། །
en: It is like a confluence because all bodhisattva prayer and conduct gather in it.

source: འཇིག་རྟེན་ཐམས་ཅད་སྐྱོང་བས་རྫི་ལྟ་བུའོ། །
en: It is like a herder because it protects all worlds.

source: སྡིག་ཏོ་ཐམས་ཅད་ལས་རྣམ་པར་ཟློག་པས་སྲུངས་མ་ལྟ་བུའོ། །
en: It is like a guard because it repels all evil.

source: ཉོན་མོངས་པའི་ལྷ་མ་ཡིན་འདྲེན་པས་དབང་པོའི་མིག་འཕྲུལ་ལྟ་བུའོ། །
en: It is like Indra’s net of illusions because it draws in the asuras of the kleśas.

source: འདུལ་བ་འདྲེན་པས་ཆུའི་ཞགས་པ་ལྟ་བུའོ། །
en: It is like Varuṇa’s noose because it draws in those to be guided.

source: བག་ཆགས་དང་བག་ལ་ཉལ་བ་དང་ཉོན་མོངས་པ་ཐམས་ཅད་གཞོབ་དུ་ཀློག་པས་དབང་པོའི་མེ་ལྟ་བུའོ། །
en: It is like Indra’s fire because it incinerates all propensities, predispositions, and kleśas.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་རྣམས་ལ་མཆོད་རྟེན་ལྟ་བུའོ། །
en: It is like a caitya for the world and its humans, devas, and asuras.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཡོན་ཏན་དེ་དག་དང་ཡོན་ཏན་གྱི་ཁྱད་པར་གཞན་དག་ཀྱང་ཚད་མེད་པ་དང་ལྡན་པ་སྟེ།
en: “Noble one, the aspiration to enlightenment has these qualities and countless other special qualities.

source: རིགས་ཀྱི་བུ་མདོར་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཇི་སྙེད་པ་དེ་སྙེད་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་ཡོན་ཏན་དང་ལེགས་པ་ཡོད་པར་བལྟའོ། །
en: “Noble one, in brief, see that however many Dharmas of the buddhas and however many qualities of the buddhas there are, they are all qualities of the aspiration to enlightenment and all perfectly present within it.

source: འདི་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་དཀྱིལ་འཁོར་རབ་ཏུ་འབྱུང་སྟེ།
en: It is because the field of activity of all bodhisattvas arises from it.

source: འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་འདི་ལས་བྱུང་ངོ་། །
en: Even all the buddhas of the past, present, and future arise from it.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་། ལྷག་པའི་བསམ་པས་ཤིན་ཏུ་བཟུང་བས་ཡོན་ཏན་ཚད་མེད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་འཇིགས་པ་མེད་པ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ།
en: “Therefore, noble one, this aspiration to the highest, complete enlightenment, through being held with the motivation for omniscience and a higher motivation, has a perfection of limitless qualities.

source: དེ་འཆང་ན་འཇིགས་པ་ལྔ་མི་འབྱུང་སྟེ། འདི་ལྟར་མེས་མི་ཚིག་གོ །དུག་གིས་མི་ཚུགས་སོ། །མཚོན་གྱིས་མི་ཆོད་དོ། །ཆུས་མི་ཁྱེར་རོ། །དུ་བས་མི་འཆིའོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་རྩི་འཆང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདོད་ཆགས་ཀྱི་མེས་མི་ཚིག་གོ །ཡུལ་གྱི་དུག་གིས་མི་ཚུགས་སོ། །ཉོན་མོངས་པའི་མཚོན་གྱིས་མི་ཆོད་དོ། །སྲིད་པའི་ཆུས་མི་ཁྱེར་རོ། །
en: “Noble one, it is like this: just as the five fears will not occur if you possess the potion called fearlessness, which means you will not be burned by fire, will not be harmed by fire, will not be cut by weapons, will not be swept away by water, and will not suffocate in smoke, in the same way, the bodhisattva who possesses the potion of the motivation toward omniscience will not be burned by the fire of desire, will not be harmed by the poison of sensory perceptions, will not be cut by the weapons of the kleśas, will not be swept away by the river of existence, and will not be suffocated by the smoke of conceptualization.

source: ཡོངས་སུ་རྟོག་པའི་དུ་བས་མི་འཆིའོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྣམ་པར་མི་གཏོང་བ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་འཆང་ན་གཞན་གྱིས་གནོད་པར་བྱ་བའི་འཇིགས་པ་ཐམས་ཅད་མི་འབྱུང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྩི་འཆང་བ་ལའང་འཁོར་བའི་གནོད་པའི་འཇིགས་པ་ཐམས་ཅད་མི་འབྱུང་ངོ་། །
en: “Noble one, just as when someone possesses the potion called never lost there is never any fear of harm from others, in the same way, no fear of harm from saṃsāra will arise in the bodhisattva who possesses the potion that is the wisdom of the aspiration to enlightenment.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། མཆུ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་འཆང་ན་དྲི་ཚོར་བ་ཙམ་གྱིས་སྦྲུལ་ཐམས་ཅད་འབྱེར་རོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རྩི་འཆང་བའི་ཡོན་ཏན་གྱི་དྲི་ཙམ་གྱིས་ཀྱང་ཉོན་མོངས་པའི་སྦྲུལ་ཐམས་ཅད་འབྱེར་བར་འགྱུར་རོ། །
en: “Noble one, just as when someone possesses the potion called maghī the mere smell of it causes snakes to flee, in the same way, the mere smell of the qualities of the bodhisattva who possesses the potion of the aspiration to enlightenment causes all the snakes of the kleśas to flee.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་གཞན་གྱིས་མི་ཐུབ་པའི་རྩི་འཆང་བ་ནི་དགྲ་ཡི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་གཞན་གྱིས་མི་ཐུབ་པའི་རྩི་འཆང་བ་ཡང་བདུད་དང་ཕྱིར་རྒོལ་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱིས་ཐུབ་པར་དཀའོ། །
en: “Noble one, just as someone who possesses the potion called invincible cannot be defeated by an entire field of enemies, in the same way, the bodhisattva who possesses the potion of an invincible aspiration to omniscience cannot be defeated by an entire field of māras and adversaries.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་བཅངས་ན་ཟུག་རྔུ་ཐམས་ཅད་འབྱིན་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་རྣམ་པར་སེལ་བ་འཆང་བ་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་ཟུག་རྔུ་ཐམས་ཅད་མི་འབྱུང་ངོ་། །
en: “Noble one, just as when someone possesses the potion called elimination all splinters will be removed, in the same way, the bodhisattva who possesses the extracting potion of the aspiration to enlightenment removes all the splinters of desire, anger, and ignorance.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྩིའི་རྒྱལ་པོ་ཆེན་པོ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་བཅངས་ན་ནད་ཐམས་ཅད་སེལ་བར་འགྱུར་རོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་རྩིའི་རྒྱལ་པོ་ཆེན་པོ་བལྟ་ན་སྡུག་པ་འཆད་པ་ཡང་ཉོན་མོངས་པ་དང་མི་ཤེས་པའི་ནད་ཐམས་ཅད་རབ་ཏུ་སེལ་བར་འགྱུར་རོ། །
en: “Noble one, just as when someone possesses the great king of potions called beauty all illnesses are dispelled, in the same way, for the bodhisattva who possesses the great king of potions, the beauty of the aspiration to enlightenment, all the illnesses of the kleśas and ignorance will be dispelled.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྩིའི་ཤིང་ཆེན་པོ་སྦྱོར་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེའི་ཤུན་པས་རྨ་ལ་རེག་མ་ཐག་ཏུ་ཐམས་ཅད་འཚོ་བར་འགྱུར་རོ། གང་ནས་བཤུས་པ་དེའི་ཤུན་ཕྲགས་ཀྱང་ཕྱིར་སྐྱེའོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ས་བོན་ལས་སྐྱེས་པའི་ཤིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྦྱོར་བ་ཡང་མཐོང་མ་ཐག་ཏུ་རིགས་ཀྱི་བུ་དད་པ་རྣམས་ཀྱི་ལས་དང་ཉོན་མོངས་པའི་རྨ་ཡོངས་སུ་འཚོ་བར་འགྱུར་རོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤིང་དེ་ལ་ཡང་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་རྨད་བྱུང་བའམ་ཉམས་པར་མི་འགྱུར་རོ། །
en: “Noble one, just as when someone possesses the great tree potion called connection all wounds are healed the instant they are touched by the bark, and wherever bark is peeled from it the bark regrows, in the same way, when the tree of connection to omniscience, which grows from the seed of the aspiration to enlightenment, is seen by noble ones with faith, their wounds of karma and kleśas will be instantly healed.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྩི་ཆེན་པོའི་རྣམ་པ་རྩ་བ་མ་གྲུབ་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེའི་མཐུས་འཛམ་བུའི་གླིང་གི་ཤིང་ཐམས་ཅད་ཀྱང་ཡན་ལག་ཐམས་ཅད་དུ་རྣམ་པར་འཕེལ་ལོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་རྩ་བ་མ་གྲུབ་པའི་རྩི་ཆེན་པོའི་མཐུས་ཀྱང་། སློབ་པ་དང་མི་སློབ་པ་དང་རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བའི་ཆོས་ཀྱི་ཤིང་རྣམས་རྣམ་པར་འཕེལ་ལོ། །
en: “Noble one, just as when someone possesses the kind of great potion called without a root all the branches of the trees in Jambudvīpa increase through its power, in the same way, through the power of the great potion without a root, which is the aspiration to enlightenment, the Dharma trees of all the training and trained śrāvakas, the pratyeka­buddhas, and the bodhisattvas will increase.

source: འདི་ལྟ་སྟེ་དཔེར་ན། དགའ་བ་འཐོབ་པ་ཞེས་བྱ་བའི་རྩི་ཡོད་དེ། དེ་སུའི་ལུས་ལ་ཐོགས་པ་དེའི་ལུས་དང་སེམས་ནད་མེད་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དགའ་བ་འཐོབ་པར་བྱེད་པའི་རྩི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལུས་དང་སེམས་ནད་མེད་པ་ཡོངས་སུ་སྐྱེད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Noble one, just as when someone possesses the potion called attainment of joy the body and mind of whoever wears it will become healthy, in the same way the attainment of joy potion of the aspiration to omniscience creates a healthy body and mind for all bodhisattvas.
